<!--
    1. Emp Name
    2. Department
    3. Emp Code
    4. Designation
    5. Salary Per Shift
-->

<!DOCTYPE html>
<html lang="ta">
    <head>
        <meta charset="UTF-8" />
        <title>{{ $emp->name . "(" . $emp->code . ")" }} - Terms and Conditions</title>

        <style>
            body {
                font-family: "TamilFont";
                font-size: 12px;
                line-height: 1;
                text-transform: uppercase;
            }

            @page {
                size: A4;
                margin: 10mm;
            }

            @font-face {
                font-family: "TamilFont";
                src: url("/fonts/NotoSansTamil-Regular.ttf") format("truetype");
            }

            .header {
                text-align: center;
                font-weight: bold;
                border-bottom: 2px solid black;
                padding-bottom: 2px;
                /* display: inline-block; */
                font-family: "Times New Roman", Times, serif;
            }

            .section p {
                line-height: 1.3;
            }

            .section-p {
                margin-left: 15px;
            }

            .section-p p {
                line-height: 1.3;
            }

            .center-bold {
                text-align: center;
            }

            .signature {
                margin-top: 50px;
                display: flex;
                justify-content: space-between;
            }

            .sign {
                margin-top: 5px;
                margin-left: 70%;
                display: flex;
                flex-direction: row;
                /* justify-content: space-between; */
                position: absolute;
            }

            .no-border td {
                border: none;
                padding-top: 10px;
                vertical-align: top;
            }

            .end {
                position: static;
                margin-top: 5px;
                margin-left: 80%;
                display: flex;
                flex-direction: row;
            }

            .page {
                height: 260mm;
                display: flex;
                flex-direction: column;
                /* justify-content: space-between; */
            }

            .page-break {
                page-break-after: always;
            }
        </style>
    </head>

    <body>
        <div class="page">
            <div class="header">
                <h1>{{ Str::upper($company->name) }}</h1>
                <p>
                    {{ Str::upper($company->address) . ", " . $company->district . " - " . $company->pincode . ", " . $company->state }}
                </p>
            </div>

            <div
                class="center-bold"
                style="font-family: 'Times New Roman', Times, serif"
            >
                <h2>
                    Terms and Conditions <br />
                    <h3>நிபந்தனைகள்</h3>
                </h2>
            </div>

            <div class="section">
                <u>
                    <strong>பெறுநர்:</strong>
                </u>
            </div>

            <table class="no-border">
                <tr>
                    <td style="padding-right: 10px;">திரு / திருமதி / செல்வி :</td>
                    <td
                        style="
                            font-family:
                                'Times New Roman', Times, serif;
                                padding-right: 300px;
                        "
                    >
                        <strong>{{$emp->name}}</strong>
                    </td>
                </tr>

                <tr>
                    <td>டிபார்ட்மெண்ட் :</td>
                    <td
                        style="
                            font-family:
                                'Times New Roman', Times, serif;
                        "
                    >
                        <strong>{{$emp->department}}</strong>
                    </td>
                </tr>

                <tr>
                    <td>வரிசை எண் :</td>
                    <td
                        style="
                            font-family:
                                'Times New Roman', Times, serif;
                        "
                    >
                        <strong>{{$emp->code}}</strong>
                    </td>
                </tr>
            </table>

            <div class="section">
                <p>
                    தாங்கள் எங்கள் நிறுவனத்தில் &nbsp;
                    <b
                        style="
                            font-family:
                                'Times New Roman', Times, serif;
                        "
                        >{{$emp->designation}}</b
                    >&nbsp; ஆக நியமனம் செய்யப்பட்டுள்ளீர்கள் என்பதை
                    மகிழ்ச்சியுடன் தெரிவித்துக் கொள்கிறோம். தங்களின் நியமனம்
                    கீழ்ககண்ட விதிமுறைகளுக்கு உட்பட்டதாகும்.
                </p>
            </div>

            <!-- CONDITIONS -->
            <div class="section bold">
                <u><b>நிபந்தனைகள்:</b></u>
            </div>
            <br />
            உமது பணி நியமனம் கீழ்கண்ட ஒழுக்க விதிமுறைகளின்
            நிபந்தனைகளுக்குட்பட்டது
            <div class="section-p">
                <p>
                    1) வேலை நேரம்: <strong> 09:00 - 18:00</strong><br />
                    தேநீர் இடைவேளை:<br />
                    <strong style="margin-left: 130px">11:00 - 11:15</strong
                    ><br />
                    <strong style="margin-left: 130px"
                        >15:30 - 15:45<br
                    /></strong>
                    மதிய உணவு: <strong>13:00 - 14:00<br /></strong>
                    ஞாயிறு மற்றும் அரசு விடுமுறை நாட்களில் விடுமுறை
                    வழங்கப்படும்.
                </p>

                <p>
                    2) உமது ஊதியம் சம்பள பட்டுவாடா சட்டம் 1936 மற்றும்
                    குறைந்தபட்ச ஊதியச் சட்டம் 1948ன் அடிப்படையில் நிர்ணயம்
                    செய்யப்படுகிறது. உமது தினசரி / மாதாந்திர ஊதியம் ரூ.
                    <strong>{{$emp->salary}}</strong>
                </p>

                <p>
                    3) உங்களின் ஊதியம் பிரதி வாரம் / மாதம் ...................
                    அன்று வழங்கப்படும்.
                </p>

                <p>
                    4) தமிழ்நாடு தொழில் நிறுவனங்கள் (பணியாளர்
                    நிரந்தரமாக்கப்படல்) சட்டம் 1981ன் படி பணியில் சேர்ந்த நாள்
                    முதல்
                    <strong
                        >{{ \Carbon\Carbon::parse($emp->d_o_j)->format('d-m-Y') }}</strong
                    >
                    தற்காலிகமாக பணி நியமனம் செய்யப்படுகிறீர்கள். அதைத் தொடர்ந்து
                    தங்களின் பணித்திறன் நடத்தை மற்றும் பணி ஆர்வம் இவற்றின்
                    அடிப்படையில் நிறுவனத்தின் நிரந்தர ஊழியராக உறுதி
                    செய்யப்படுவீர்.
                </p>

                <p>
                    5) மிகை நேர வேலை யாரிடமும் கட்டாயப்படுத்தப்பட மாட்டாது.
                    ஊழியர்களின் சம்மதத்தின் அடிப்படையில் மட்டுமே
                    அனுமதிக்கப்படுகிறது.
                </p>

                <p>
                    6) தொழிலாளர் அரசு காப்பீட்டு சட்டம் (ESI) 1948 மற்றும்
                    தொழிலாளர் வருங்கால வைப்புநிதிச் சட்டம் (PF) 1952
                    விதிகளின்படி உமது ஊதியத்தில் பிடித்தம் செய்யப்பட்டு அத்தோடு
                    நிறுவனத்தின் பங்கையும் சேர்த்து உமது காப்பீடு மற்றும்
                    வைப்புநிதி கணக்கில் செலுத்தப்டும்.
                </p>

                <p>
                    7) போனஸ் வழங்கல் சட்டம் 1965ன் படி குறைந்த பட்ச ஊக்கத்
                    தொகையான 8.33%ற்கு நிர்வாகம் உத்திரவாதம் அளிக்கிறது .
                </p>

                <p>
                    8) தமிழ்நாடு தொழில் நிறுவனங்களின் தேசிய மற்றும் பண்டிகை
                    விடுமுறைகள் சட்டம் 1958ன் படி பொது விடுமுறைகள்
                    அறிவிக்கப்டும்.
                </p>

                <p>
                    9) சம்பளம், சம்பள உயர்வு, போனஸ் மற்றும் இழப்புத் தொகை
                    போன்றவைகள் உள்ளூர் தொழிலாளர்கள் மற்றும் உற்பத்தியாளர்கள்
                    சங்கங்களின் முடிவுகளின்படி வழங்கப்டும்.
                </p>

                <p>
                    10) 18 வயதுக்குட்பட்டவர்கள் நிறுவனத்தில் வேலை செய்ய
                    அனுமதிக்கப்பட மாட்டாது.
                </p>

                <p>
                    11) வேலை நேரங்களில் அவசர தேவைகள் தவிர வெளியே செல்ல அனுமதி
                    கிடையாது.
                </p>

                <p>
                    12) விருப்பமில்லாத பணியாளர்களை வேலை செய்ய வற்புறுத்தப்பட
                    மாட்டாது.
                </p>

                <p>
                    13) அவசர விடுப்புகள் தவிர மற்ற விடுப்புகளுக்கு முன் அனுமதி
                    பெற வேண்டும்.
                </p>

                <p>
                    14) நிறுவனத்திற்குள் வேலை செய்யும்போது தங்களையும்
                    நிறுவனத்தையும் தூய்மையாக வைத்துக் கொள்ள வேண்டும்.
                </p>
            </div>
        </div>
        <div class="page-break"></div>
        <div class="page">
            <div class="section-p">
                <p>
                    15) வேலை நேரங்களில் குறைகள் மற்றும் இடையூறுகள் ஏதும்
                    இருப்பின் நிறுவன உரிமையாளரை நேரடியாக அணுகி முறையீடு
                    செய்யலாம்.
                </p>
                <p>
                    16) பணியில் ஈடுபாடின்மை தொழிலாளர் நிலை ஆணைகளை அவமதித்தல்
                    மற்றும் தொழில் நிறுவனங்கள் நிலை ஆணைகள் சட்டம் 1946ன் விதிகளை
                    மீறல் போன்றவைகளுக்கு நிர்வாகம் ஒழுங்கு நடவடிக்கை எடுக்கலாம்.
                </p>

                <p>
                    17) இதர மத்திய மாநில அரசின் தொழிலாளர் நலச் சட்டங்களும்
                    திட்டங்களும் பாரபட்சமின்றி கடைபிடிக்கப்படும்.
                </p>

                <p>
                    18) நிர்வாகம் சாதி, இனம், மதம், நிறம், பாலினம் போன்ற எந்தவித
                    பாகுபாடும் அனுமதிப்பதில்லை. தொழிலாளர்களின் உணர்வுகளை
                    புண்படுத்தும் இந்நிகழ்வுகளை கண்ணுற்றால் உடனே அதை
                    நிர்வாகத்தின் பார்வைக்கு கொணர்வது தங்களின் தார்மீகக்
                    கடமையாகும்.
                </p>

                <p>
                    19) தங்களின் பணிக்காலத்தில் தாங்கள் ஒரு பணியிலிருந்து
                    மற்றொரு பணிக்கோ அல்லது பிரிவு துறையிலிருந்து மற்றொரு
                    பிரிவு/துறைக்கு அல்லது வேறு இடத்தில் உள்ள நமது
                    தொழிற்சாலைக்கும் மற்றும் எமது கிளைக்கு மாற்றம்
                    செய்யப்படலாம்.
                </p>
                <P>
                    20) நமது பணிக்காலத்தில் வேலை பார்க்கின்ற கால கட்டத்தில் நீர்
                    வேறு தொழிற்சாலையில் வேலை செய்வது அல்லது சொந்த வியாபாரம்
                    செய்வது கூடாது. மேலும் தொழிற்சாலையின் நலனில் அக்கறை கொண்டு
                    தங்களின் பணியினை செவ்வனே செய்ய வேண்டும்.
                </P>

                <P>
                    21) தாங்கள் பணியில் சேரும் போது மற்றும் பணியில் தொடரும்
                    காலத்தில் தொழிற்சாலை பற்றிய எந்தவிதமான தகவல்களையும்
                    முக்கியமான திட்டங்கள் வடிவமைப்பு மற்றும் தொழிற்சாலையின் மற்ற
                    நடவடிக்கையும் எந்த ஒரு வெளியாட்களிடமும் வெளிப்படுத்தக்
                    கூடாது.
                </P>

                <p>
                    22) தாங்கள் 58 வயதை அடையும் போது பணியில் இருந்து ஒய்வு
                    பெறுவீர்கள்.
                </p>

                <p>
                    23) தாங்கள் தங்கள் பணியிலிருந்து நிற்கும் முன்னர் ஒரு மாத
                    முன்அறிவிப்பு நிர்வாகத்திற்கு கொடுத்தல் வேண்டும். அவ்வாறு
                    இல்லையெனில் தங்களுடைய ஒரு மாத சம்பளம் முன்அறிவிப்பின்றி
                    நிர்வாகத்தினால் பிடித்தல் செய்யப்படும். ஒழுங்கு
                    விதிமுறைகளின் மீறல் காரணமாக நிர்வாகத்தினால்
                    முன்அறிவிப்பின்றி தொழிலாளர்களை பணிநீக்கம் செய்ய
                    நிர்வாகத்திற்கு முழு அதிகாரம் உண்டு.
                </p>

                <p>
                    24) அவ்வாறு தாங்கள் முன்அறிவிப்பின்றி பணி நீக்கம் செய்யப்பட
                    நேர்ந்தால் தங்களுக்கு ஒரு மாத சம்பளம் ஊதியமாக வழங்கப்படும்.
                </p>

                <p>
                    25) தங்களின் சரியான விலாசம் மற்றும் விலாசத்தில் ஏதேனும்
                    மாற்றம் இருப்பின் அதை உடனடியாக நிறுவனத்திற்கு அறிவிறக்கும்படி
                    கேட்டுக் கொள்ளப்படுகிறீர்கள்.
                </p>

                <p>
                    26) தாங்கள் தொழிற்சாலையின் சட்ட திட்டங்களுக்கும் அவ்வப்போது
                    மாற்றப்படும் சட்ட திட்டங்களுக்கும்
                    கட்டுப்படுத்தப்படுவீர்கள்.
                </p>

                <p>
                    27) தாங்கள் முதன் முதலில் பணிக்கு ஆஜராகும் நாள் தான் பணிக்கு
                    சேர்ந்த நாளாக கருதப்படும்.
                </p>

                <div class="section">
                    <p>
                        இந்த கடிதம் இரண்டு பிரதிகளாக வழங்கப்படும். தாங்கள் மேலே
                        குறிப்பிட்ட சட்ட திட்டங்களை ஏற்றுக் கொள்வதன் அடையாளமாக
                        ஒரு பிரதியை உங்களின் கையொப்பமிட்ட தருமாறு கேட்டுக்
                        கொள்ளப்படுகுறீர்கள்.
                    </p>

                    <p>
                        நான் மேலே குறிப்பிட்டுள்ள யாவையும் படித்து / படிக்க
                        கேட்டு புரிந்து கொண்டேன். கம்பெனியின் சட்ட
                        திட்டங்களுக்கு கட்டுப்பட்டு நடந்து கொள்வேன் என உறுதி
                        கூறுகிறேன்.
                    </p>
                </div>
                <br />
                <span class="end">இப்படிக்கு,</span>
                <div class="signature">
                    <div>
                        <p>படித்து / படிக்க கேட்டு புரிந்துகொண்டேன்.</p>
                        <p>தொழிலாளர் கையொப்பம்.</p>
                    </div>

                    <div class="sign">
                        <p>முதலாளி அல்லது அதிகாரம் பெற்ற அதிகாரி.</p>
                    </div>
                </div>

                <table class="no-border">
                    <tr>
                        <td>இடம் :</td>
                    </tr>
                    <br />
                    <tr>
                        <td>தேதி :</td>
                    </tr>
                </table>
                <div style="margin-top: 5px">தொழிலாளர் குறிப்பேடு</div>
            </div>
        </div>
    </body>
</html>
